<?php
$a = 5;
$b = '05';
var_dump($a == $b);
#Получаем bool(true). В результате операции произошло неявное преобразование типов из строки в int.
# Результат сравнения = истина
var_dump((int)'012345');
#Получаем int(12345). Явно преобразуем строку в число.
var_dump((float)123.0 === (int)123.0);
#Получаем bool(false), так как значения явно преобразованы в разные типы данных. === - оператор Тождественно равно.
# Возвращает true, только если значения равны и имеет тот же тип.
var_dump(0 == 'hello, world');
#Получаем bool(false), так как Сравнение выполняется численно, если оба операнда - числовые строки,
# или один операнд - число, а другой - числовая строка(PHP считает строку (string) числовой,
# если строку возможно интерпретировать как целое число (int) или как число с плавающей точкой (float)).
# Так как строка 'hello, world' - не является числовой, сравниваются строки.